Tekla Open API Reference for Tekla Structures 2025
Integer Structure
 The Integer datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
[TypeConverterAttribute(typeof(IntegerConverter))]
public struct Integer : IXmlSerializable, IIntDataType,
	IDataType
<SerializableAttribute>
<TypeConverterAttribute(GetType(IntegerConverter))>
Public Structure Integer
	Implements IXmlSerializable, IIntDataType, IDataType
The Integer type exposes the following members.
Constructors
Name | Description
Integer
 Creates a new integer datatype instance.
Top
Properties
Name | Description
Value
 The value of the integer datatype.
Top
Methods
Name | Description
Equals
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
GetSchema
 Gets the XML Schema for the datatype.
ReadXml
 Parses a new value from the given reader.
ToString
 Returns the string representation of the object.
 (Overrides ValueType.ToString().)
WriteXml
 Writes the value as XML to the given writer.
Top
Operators
Name | Description
Equality
 Compares an int value with a Datatype.Integer value.
Implicit(Int32 to Integer)
 Converts from int to Datatype.Integer.
Implicit(Integer to Int32)
 Converts from Datatype.Integer to int.
Inequality
 Compares an int value with a Datatype.Integer value.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace